//1 - sayHi is not a function
/*
sayHi("Hi");

var sayHi = function (name) {
  console.log("Hello" + name);
};
*/

//2
// var a = ["one", "tow"];
// console.log(a.join());
/*
var a = 1;
a > 0 ? ((a += 1), a++) : a;
console.log(a);
*/
//3
/*
function showMessage(from, text) {
  // аргументы: from, text
  console.log(from + ": " + text);
}

showMessage("Аня", "Привет!", "22"); // Аня: Привет! (*)
*/
//4 Входил ли подстрока в строку ? a.indexOf(b)
/*
var b = "hell";
var a = "hello";

console.log(a.indexOf(b));
*/
//5 Побитовые операторы в JavaScript работают с 32-битными целыми числами в их двоичном представлении.

//6 a=3
/*
var a = 1;
a = 2;
var a = 3;
console.log(a);
*/
//7 Оператор запятая выполняет каждый из его операндов (слева направо) и возвращает значение последнего операнда.

//8 Внешние скрипты - Подключать внешние скрипты можно внутри тега <head> или <body>.

//9 Цикл — управляющая конструкция в высокоуровневых языках программирования, предназначенная для организации многократного исполнения набора инструкций.
